In [4]:
import pandas as pd

In [3]:
# data type----->
# 1. Series-----1D
# 2. DataFrame ---->2D

In [5]:
s=['manish','shan','jeet','rahul','rohan']

In [6]:
s

['manish', 'shan', 'jeet', 'rahul', 'rohan']

In [7]:
s1=pd.Series(s)

In [8]:
s1

0    manish
1      shan
2      jeet
3     rahul
4     rohan
dtype: object

In [9]:
s1[0]

'manish'

In [10]:
s1[1]

'shan'

In [11]:
s[2]

'jeet'

In [12]:
s

['manish', 'shan', 'jeet', 'rahul', 'rohan']

In [13]:
s1

0    manish
1      shan
2      jeet
3     rahul
4     rohan
dtype: object

In [15]:
s1.dtype

dtype('O')

In [16]:
type(s1)

pandas.core.series.Series

In [18]:
s2=pd.Series([1,2,3,4,5,7,8])

In [19]:
s1

0    manish
1      shan
2      jeet
3     rahul
4     rohan
dtype: object

In [20]:
s2

0    1
1    2
2    3
3    4
4    5
5    7
6    8
dtype: int64

In [21]:
s2.dtype

dtype('int64')

In [22]:
s1.ndim

1

In [23]:
d={
    'Id':[1,2,3,4,5,6,7],
    'Name':['mann','shan','jeet','neha','rahul','rohan','shubh'],
    'address':['jaipur','ajmer','udaipur','ahmd','pune','delhi','mumbai']
}

In [24]:
df=pd.DataFrame(d)

In [25]:
df

   Id   Name  address
0   1   mann   jaipur
1   2   shan    ajmer
2   3   jeet  udaipur
3   4   neha     ahmd
4   5  rahul     pune
5   6  rohan    delhi
6   7  shubh   mumbai

In [101]:
r=[[1,2,3,4],['a','b','c','d'],['ab','bc','cd','de']]

In [102]:
df1=pd.DataFrame(r)
df1.T

   0  1   2
0  1  a  ab
1  2  b  bc
2  3  c  cd
3  4  d  de

In [103]:
df1=df1.T
df1

   0  1   2
0  1  a  ab
1  2  b  bc
2  3  c  cd
3  4  d  de

In [104]:
df1.columns=['Id','name','add']

In [105]:
df1

  Id name add
0  1    a  ab
1  2    b  bc
2  3    c  cd
3  4    d  de

In [45]:
df1.columns=['A','B','C']

In [46]:
df1

   A  B   C
0  1  a  ab
1  2  b  bc
2  3  c  cd
3  4  d  de

In [47]:
df1.index=['a','b','c','d']

In [48]:
df1

   A  B   C
a  1  a  ab
b  2  b  bc
c  3  c  cd
d  4  d  de

In [50]:
df.columns=['sid','sname','sadd']

In [51]:
df

   sid  sname     sadd
0    1   mann   jaipur
1    2   shan    ajmer
2    3   jeet  udaipur
3    4   neha     ahmd
4    5  rahul     pune
5    6  rohan    delhi
6    7  shubh   mumbai

In [52]:
# add columns and row

In [54]:
df1

   A  B   C
a  1  a  ab
b  2  b  bc
c  3  c  cd
d  4  d  de

In [56]:
df1['D']=[10,20,30,40]

In [57]:
df1

   A  B   C   D
a  1  a  ab  10
b  2  b  bc  20
c  3  c  cd  30
d  4  d  de  40

In [58]:
df1['A*D']=df1['A']*df1['D']

In [59]:
df1

   A  B   C   D  A*D
a  1  a  ab  10   10
b  2  b  bc  20   40
c  3  c  cd  30   90
d  4  d  de  40  160

In [60]:
df1

   A  B   C   D  A*D
a  1  a  ab  10   10
b  2  b  bc  20   40
c  3  c  cd  30   90
d  4  d  de  40  160

In [61]:
df1['A']

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [62]:
df1['B']

a    a
b    b
c    c
d    d
Name: B, dtype: object

In [63]:
df1.A

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [64]:
df1.B

a    a
b    b
c    c
d    d
Name: B, dtype: object

In [65]:
df1['A']

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [66]:
df1

   A  B   C   D  A*D
a  1  a  ab  10   10
b  2  b  bc  20   40
c  3  c  cd  30   90
d  4  d  de  40  160

In [73]:
df1[['A','D','B']]['a':'b']

   A   D  B
a  1  10  a
b  2  20  b

In [74]:
df1

   A  B   C   D  A*D
a  1  a  ab  10   10
b  2  b  bc  20   40
c  3  c  cd  30   90
d  4  d  de  40  160

In [75]:
df1.A

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [76]:
df1['A']

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [85]:
b=df1['A']

In [86]:
b

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [87]:
b1=df1[['A']]

In [90]:
b1.ndim

2

In [91]:
b.ndim

1

In [92]:
b

a    1
b    2
c    3
d    4
Name: A, dtype: object

In [93]:
b1

   A
a  1
b  2
c  3
d  4

In [95]:
df1

   A  B   C   D  A*D
a  1  a  ab  10   10
b  2  b  bc  20   40
c  3  c  cd  30   90
d  4  d  de  40  160

In [96]:
# single  or multi or 1d or 2d

In [100]:
df1.loc['a']     # loc(object) or iloc(integer)

A       1
B       a
C      ab
D      10
A*D    10
Name: a, dtype: object

In [99]:
df1

   A  B   C   D  A*D
a  1  a  ab  10   10
b  2  b  bc  20   40
c  3  c  cd  30   90
d  4  d  de  40  160

In [112]:
df1.index=['a','b','c','d']

In [117]:
df1.loc['a']

Id       1
name     a
add     ab
Name: a, dtype: object

In [109]:
df

   sid  sname     sadd
0    1   mann   jaipur
1    2   shan    ajmer
2    3   jeet  udaipur
3    4   neha     ahmd
4    5  rahul     pune
5    6  rohan    delhi
6    7  shubh   mumbai

In [111]:
df

   sid  sname     sadd
0    1   mann   jaipur
1    2   shan    ajmer
2    3   jeet  udaipur
3    4   neha     ahmd
4    5  rahul     pune
5    6  rohan    delhi
6    7  shubh   mumbai

In [114]:
df1

  Id name add
a  1    a  ab
b  2    b  bc
c  3    c  cd
d  4    d  de